[
  {
    "source": "jstage",
    "title": "デジタルヘルスケアプラットフォーム",
    "content": "本研究ではデジタルヘルスケアプラットフォームについて検討する。従来手法の課題を解決するため、新しいアプローチを提案した。実験結果により、提案手法の有効性が確認された。今後は実用化に向けた検討を進める予定である。",
    "domain": "communication_studies",
    "language": "ja",
    "year": "2021",
    "generated": true
  },
  {
    "source": "arxiv",
    "title": "Not All Tokens Are Meant to Be Forgotten",
    "content": "Large Language Models (LLMs), pre-trained on massive text corpora, exhibit\nremarkable human-level language understanding, reasoning, and decision-making\nabilities. However, they tend to memorize unwanted information, such as private\nor copyrighted content, raising significant privacy and legal concerns.\nUnlearning has emerged as a promising solution, but existing methods face a\nsignificant challenge of over-forgetting. This issue arises because they\nindiscriminately suppress the generation of all the tokens in forget samples,\nleading to a substantial loss of model utility. To overcome this challenge, we\nintroduce the Targeted Information Forgetting (TIF) framework, which consists\nof (1) a flexible targeted information identifier designed to differentiate\nbetween unwanted words (UW) and general words (GW) in the forget samples, and\n(2) a novel Targeted Preference Optimization approach that leverages Logit\nPreference Loss to unlearn unwanted information associated with UW and\nPreservation Loss to retain general information in GW, effectively improving\nthe unlearning process while mitigating utility degradation. Extensive\nexperiments on the TOFU and MUSE benchmarks demonstrate that the proposed TIF\nframework enhances unlearning effectiveness while preserving model utility and\nachieving state-of-the-art results.",
    "category": "cs.LG",
    "published": "2025-06-03T17:59:05Z",
    "language": "en",
    "domain": "machine_learning"
  },
  {
    "source": "acm",
    "title": "自然言語処理による日本語文書解析",
    "content": "本研究では自然言語処理による日本語文書解析について検討する。従来手法の課題を解決するため、新しいアプローチを提案した。実験結果により、提案手法の有効性が確認された。今後は実用化に向けた検討を進める予定である。",
    "domain": "materials_science",
    "language": "ja",
    "year": "2022",
    "generated": true
  },
  {
    "source": "arxiv",
    "title": "Native-Resolution Image Synthesis",
    "content": "We introduce native-resolution image synthesis, a novel generative modeling\nparadigm that enables the synthesis of images at arbitrary resolutions and\naspect ratios. This approach overcomes the limitations of conventional\nfixed-resolution, square-image methods by natively handling variable-length\nvisual tokens, a core challenge for traditional techniques. To this end, we\nintroduce the Native-resolution diffusion Transformer (NiT), an architecture\ndesigned to explicitly model varying resolutions and aspect ratios within its\ndenoising process. Free from the constraints of fixed formats, NiT learns\nintrinsic visual distributions from images spanning a broad range of\nresolutions and aspect ratios. Notably, a single NiT model simultaneously\nachieves the state-of-the-art performance on both ImageNet-256x256 and 512x512\nbenchmarks. Surprisingly, akin to the robust zero-shot capabilities seen in\nadvanced large language models, NiT, trained solely on ImageNet, demonstrates\nexcellent zero-shot generalization performance. It successfully generates\nhigh-fidelity images at previously unseen high resolutions (e.g., 1536 x 1536)\nand diverse aspect ratios (e.g., 16:9, 3:1, 4:3), as shown in Figure 1. These\nfindings indicate the significant potential of native-resolution modeling as a\nbridge between visual generative modeling and advanced LLM methodologies.",
    "category": "cs.CV",
    "published": "2025-06-03T17:57:33Z",
    "language": "en",
    "domain": "computer_vision"
  },
  {
    "source": "pubmed",
    "title": "Application of computer vision in radiology: A systematic review",
    "content": "Background: The application of computer vision radiology has shown promising results in recent studies. Methods: We conducted a systematic review of literature published between 2020-2024. Results: Our analysis revealed significant improvements in diagnostic accuracy and treatment outcomes. Conclusion: computer vision represents a valuable tool for advancing radiology practice.",
    "domain": "medicine",
    "language": "en",
    "year": "2024"
  },
  {
    "source": "springer",
    "title": "ブロックチェーン技術の食品トレーサビリティ",
    "content": "本研究ではブロックチェーン技術の食品トレーサビリティについて検討する。従来手法の課題を解決するため、新しいアプローチを提案した。実験結果により、提案手法の有効性が確認された。今後は実用化に向けた検討を進める予定である。",
    "domain": "software_engineering",
    "language": "ja",
    "year": "2023",
    "generated": true
  },
  {
    "source": "jstage",
    "title": "Study on AI and 経済学",
    "content": "This study investigates the application of artificial intelligence in コンピュータサイエンス. 実験では、machine learningアルゴリズムを用いて解析を行った。",
    "domain": "medicine",
    "language": "en-ja",
    "year": "2024"
  },
  {
    "source": "arxiv",
    "title": "Natural language processing in 多言語対応システム",
    "content": "This research focuses on Natural language processing in 多言語対応システム. 本研究では、advanced technology と traditional methods を組み合わせたapproachを提案する。Experimental results show that 提案手法は従来手法よりも優れた性能を示した。Future research will explore より実用的なapplicationsを検討する。",
    "domain": "cognitive_science",
    "language": "en-ja",
    "year": "2022",
    "generated": true
  },
  {
    "source": "ieee",
    "title": "IoT systems for スマート農業 development",
    "content": "This research focuses on IoT systems for スマート農業 development. 本研究では、advanced technology と traditional methods を組み合わせたapproachを提案する。Experimental results show that 提案手法は従来手法よりも優れた性能を示した。Future research will explore より実用的なapplicationsを検討する。",
    "domain": "environmental_science",
    "language": "en-ja",
    "year": "2022",
    "generated": true
  },
  {
    "source": "pubmed",
    "title": "Application of data mining in epidemiology: A systematic review",
    "content": "Background: The application of data mining epidemiology has shown promising results in recent studies. Methods: We conducted a systematic review of literature published between 2020-2024. Results: Our analysis revealed significant improvements in diagnostic accuracy and treatment outcomes. Conclusion: data mining represents a valuable tool for advancing epidemiology practice.",
    "domain": "medicine",
    "language": "en",
    "year": "2020"
  },
  {
    "source": "pubmed",
    "title": "Application of natural language in clinical: A systematic review",
    "content": "Background: The application of natural language processing clinical has shown promising results in recent studies. Methods: We conducted a systematic review of literature published between 2020-2024. Results: Our analysis revealed significant improvements in diagnostic accuracy and treatment outcomes. Conclusion: natural language represents a valuable tool for advancing clinical practice.",
    "domain": "medicine",
    "language": "en",
    "year": "2021"
  },
  {
    "source": "arxiv",
    "title": "Causal Estimation of Tokenisation Bias",
    "content": "Modern language models are typically trained over subword sequences, but\nultimately define probabilities over character-strings. Ideally, the choice of\nthe tokeniser -- which maps character-strings to subwords -- should not affect\nthe probability assigned to the underlying character-string; in practice, it\ndoes. We define this mismatch as tokenisation bias. In this work, we quantify\none particular type of tokenisation bias: the effect of including or not a\nsubword (e.g., $\\langle hello \\rangle$) in a tokeniser's vocabulary on the\nprobability a trained model assigns to the corresponding characters (i.e.,\n\\textit{``hello''}). Estimating this effect is challenging because each model\nis trained with only one tokeniser. We address this by framing tokenisation\nbias as a causal effect and estimating it using the regression discontinuity\ndesign. Specifically, we exploit the fact that tokenisation algorithms rank\nsubwords and add the first $K$ to a tokeniser's vocabulary, where $K$ is an\narbitrary cutoff point. As such, we can estimate a causal effect by comparing\nsimilar subwords around this cutoff. Experimentally, we find that tokenisation\nconsistently affects models' outputs across scales, vocabularies, and\ntokenisers. Notably, a subword's presence in a small model's vocabulary may\nincrease its characters' probability by up to 17 times, highlighting\ntokenisation as a key design choice in language modelling.",
    "category": "cs.AI",
    "published": "2025-06-03T17:59:47Z",
    "language": "en",
    "domain": "artificial_intelligence"
  },
  {
    "source": "pubmed",
    "title": "Application of natural language in clinical: A systematic review",
    "content": "Background: The application of natural language processing clinical has shown promising results in recent studies. Methods: We conducted a systematic review of literature published between 2020-2024. Results: Our analysis revealed significant improvements in diagnostic accuracy and treatment outcomes. Conclusion: natural language represents a valuable tool for advancing clinical practice.",
    "domain": "medicine",
    "language": "en",
    "year": "2022"
  },
  {
    "source": "pubmed",
    "title": "Cybersecurity in IoT Networks",
    "content": "This study investigates cybersecurity in iot networks. We propose a novel approach that combines advanced computational methods with practical applications. Our experimental results demonstrate significant improvements in performance metrics. The methodology involves comprehensive data collection, rigorous analysis, and validation through multiple test scenarios. Future work will focus on scalability and real-world deployment considerations.",
    "domain": "environmental_science",
    "language": "en",
    "year": "2023",
    "generated": true
  },
  {
    "source": "pubmed",
    "title": "Application of data mining in epidemiology: A systematic review",
    "content": "Background: The application of data mining epidemiology has shown promising results in recent studies. Methods: We conducted a systematic review of literature published between 2020-2024. Results: Our analysis revealed significant improvements in diagnostic accuracy and treatment outcomes. Conclusion: data mining represents a valuable tool for advancing epidemiology practice.",
    "domain": "medicine",
    "language": "en",
    "year": "2022"
  },
  {
    "source": "jstage",
    "title": "機械学習に関する研究 第25報",
    "content": "本研究では医学の応用について検討した。実験結果により、提案手法の有効性が確認された。",
    "domain": "medicine",
    "language": "ja",
    "year": "2022"
  },
  {
    "source": "pubmed",
    "title": "Application of data mining in epidemiology: A systematic review",
    "content": "Background: The application of data mining epidemiology has shown promising results in recent studies. Methods: We conducted a systematic review of literature published between 2020-2024. Results: Our analysis revealed significant improvements in diagnostic accuracy and treatment outcomes. Conclusion: data mining represents a valuable tool for advancing epidemiology practice.",
    "domain": "medicine",
    "language": "en",
    "year": "2020"
  },
  {
    "source": "ieee",
    "title": "Digital Transformation in Education",
    "content": "This study investigates digital transformation in education. We propose a novel approach that combines advanced computational methods with practical applications. Our experimental results demonstrate significant improvements in performance metrics. The methodology involves comprehensive data collection, rigorous analysis, and validation through multiple test scenarios. Future work will focus on scalability and real-world deployment considerations.",
    "domain": "software_engineering",
    "language": "en",
    "year": "2021",
    "generated": true
  },
  {
    "source": "arxiv",
    "title": "IllumiCraft: Unified Geometry and Illumination Diffusion for\n  Controllable Video Generation",
    "content": "Although diffusion-based models can generate high-quality and high-resolution\nvideo sequences from textual or image inputs, they lack explicit integration of\ngeometric cues when controlling scene lighting and visual appearance across\nframes. To address this limitation, we propose IllumiCraft, an end-to-end\ndiffusion framework accepting three complementary inputs: (1)\nhigh-dynamic-range (HDR) video maps for detailed lighting control; (2)\nsynthetically relit frames with randomized illumination changes (optionally\npaired with a static background reference image) to provide appearance cues;\nand (3) 3D point tracks that capture precise 3D geometry information. By\nintegrating the lighting, appearance, and geometry cues within a unified\ndiffusion architecture, IllumiCraft generates temporally coherent videos\naligned with user-defined prompts. It supports background-conditioned and\ntext-conditioned video relighting and provides better fidelity than existing\ncontrollable video generation methods. Project Page:\nhttps://yuanze-lin.me/IllumiCraft_page",
    "category": "cs.AI",
    "published": "2025-06-03T17:59:52Z",
    "language": "en",
    "domain": "artificial_intelligence"
  },
  {
    "source": "arxiv",
    "title": "VLCD: Vision-Language Contrastive Distillation for Accurate and\n  Efficient Automatic Placenta Analysis",
    "content": "Pathological examination of the placenta is an effective method for detecting\nand mitigating health risks associated with childbirth. Recent advancements in\nAI have enabled the use of photographs of the placenta and pathology reports\nfor detecting and classifying signs of childbirth-related pathologies. However,\nexisting automated methods are computationally extensive, which limits their\ndeployability. We propose two modifications to vision-language contrastive\nlearning (VLC) frameworks to enhance their accuracy and efficiency: (1)\ntext-anchored vision-language contrastive knowledge distillation (VLCD)-a new\nknowledge distillation strategy for medical VLC pretraining, and (2)\nunsupervised predistillation using a large natural images dataset for improved\ninitialization. Our approach distills efficient neural networks that match or\nsurpass the teacher model in performance while achieving model compression and\nacceleration. Our results showcase the value of unsupervised predistillation in\nimproving the performance and robustness of our approach, specifically for\nlower-quality images. VLCD serves as an effective way to improve the efficiency\nand deployability of medical VLC approaches, making AI-based healthcare\nsolutions more accessible, especially in resource-constrained environments.",
    "category": "cs.CL",
    "published": "2025-06-02T20:12:27Z",
    "language": "en",
    "domain": "natural_language_processing"
  },
  {
    "source": "acm",
    "title": "Natural language processing in 多言語対応システム",
    "content": "This research focuses on Natural language processing in 多言語対応システム. 本研究では、advanced technology と traditional methods を組み合わせたapproachを提案する。Experimental results show that 提案手法は従来手法よりも優れた性能を示した。Future research will explore より実用的なapplicationsを検討する。",
    "domain": "marketing_research",
    "language": "en-ja",
    "year": "2023",
    "generated": true
  },
  {
    "source": "pubmed",
    "title": "Application of data mining in epidemiology: A systematic review",
    "content": "Background: The application of data mining epidemiology has shown promising results in recent studies. Methods: We conducted a systematic review of literature published between 2020-2024. Results: Our analysis revealed significant improvements in diagnostic accuracy and treatment outcomes. Conclusion: data mining represents a valuable tool for advancing epidemiology practice.",
    "domain": "medicine",
    "language": "en",
    "year": "2024"
  },
  {
    "source": "arxiv",
    "title": "Cybersecurity measures for クラウドコンピューティング",
    "content": "This research focuses on Cybersecurity measures for クラウドコンピューティング. 本研究では、advanced technology と traditional methods を組み合わせたapproachを提案する。Experimental results show that 提案手法は従来手法よりも優れた性能を示した。Future research will explore より実用的なapplicationsを検討する。",
    "domain": "business_analytics",
    "language": "en-ja",
    "year": "2020",
    "generated": true
  },
  {
    "source": "jstage",
    "title": "Precision Medicine and Genomics",
    "content": "This study investigates precision medicine and genomics. We propose a novel approach that combines advanced computational methods with practical applications. Our experimental results demonstrate significant improvements in performance metrics. The methodology involves comprehensive data collection, rigorous analysis, and validation through multiple test scenarios. Future work will focus on scalability and real-world deployment considerations.",
    "domain": "digital_sociology",
    "language": "en",
    "year": "2020",
    "generated": true
  },
  {
    "source": "pubmed",
    "title": "Application of deep learning in imaging: A systematic review",
    "content": "Background: The application of deep learning medical imaging has shown promising results in recent studies. Methods: We conducted a systematic review of literature published between 2020-2024. Results: Our analysis revealed significant improvements in diagnostic accuracy and treatment outcomes. Conclusion: deep learning represents a valuable tool for advancing imaging practice.",
    "domain": "medicine",
    "language": "en",
    "year": "2023"
  },
  {
    "source": "jstage",
    "title": "Autonomous Vehicle Navigation Systems",
    "content": "This study investigates autonomous vehicle navigation systems. We propose a novel approach that combines advanced computational methods with practical applications. Our experimental results demonstrate significant improvements in performance metrics. The methodology involves comprehensive data collection, rigorous analysis, and validation through multiple test scenarios. Future work will focus on scalability and real-world deployment considerations.",
    "domain": "marketing_research",
    "language": "en",
    "year": "2022",
    "generated": true
  },
  {
    "source": "springer",
    "title": "Natural Language Processing for Legal Documents",
    "content": "This study investigates natural language processing for legal documents. We propose a novel approach that combines advanced computational methods with practical applications. Our experimental results demonstrate significant improvements in performance metrics. The methodology involves comprehensive data collection, rigorous analysis, and validation through multiple test scenarios. Future work will focus on scalability and real-world deployment considerations.",
    "domain": "digital_health",
    "language": "en",
    "year": "2024",
    "generated": true
  },
  {
    "source": "ieee",
    "title": "Data analytics for 消費者行動 prediction",
    "content": "This research focuses on Data analytics for 消費者行動 prediction. 本研究では、advanced technology と traditional methods を組み合わせたapproachを提案する。Experimental results show that 提案手法は従来手法よりも優れた性能を示した。Future research will explore より実用的なapplicationsを検討する。",
    "domain": "robotics",
    "language": "en-ja",
    "year": "2020",
    "generated": true
  },
  {
    "source": "arxiv",
    "title": "Token and Span Classification for Entity Recognition in French\n  Historical Encyclopedias",
    "content": "Named Entity Recognition (NER) in historical texts presents unique challenges\ndue to non-standardized language, archaic orthography, and nested or\noverlapping entities. This study benchmarks a diverse set of NER approaches,\nranging from classical Conditional Random Fields (CRFs) and spaCy-based models\nto transformer-based architectures such as CamemBERT and sequence-labeling\nmodels like Flair. Experiments are conducted on the GeoEDdA dataset, a richly\nannotated corpus derived from 18th-century French encyclopedias. We propose\nframing NER as both token-level and span-level classification to accommodate\ncomplex nested entity structures typical of historical documents. Additionally,\nwe evaluate the emerging potential of few-shot prompting with generative\nlanguage models for low-resource scenarios. Our results demonstrate that while\ntransformer-based models achieve state-of-the-art performance, especially on\nnested entities, generative models offer promising alternatives when labeled\ndata are scarce. The study highlights ongoing challenges in historical NER and\nsuggests avenues for hybrid approaches combining symbolic and neural methods to\nbetter capture the intricacies of early modern French text.",
    "category": "cs.CL",
    "published": "2025-06-03T13:37:44Z",
    "language": "en",
    "domain": "natural_language_processing"
  },
  {
    "source": "ieee",
    "title": "Natural language processing in 多言語対応システム",
    "content": "This research focuses on Natural language processing in 多言語対応システム. 本研究では、advanced technology と traditional methods を組み合わせたapproachを提案する。Experimental results show that 提案手法は従来手法よりも優れた性能を示した。Future research will explore より実用的なapplicationsを検討する。",
    "domain": "data_science",
    "language": "en-ja",
    "year": "2020",
    "generated": true
  },
  {
    "source": "ieee",
    "title": "Autonomous Vehicle Navigation Systems",
    "content": "This study investigates autonomous vehicle navigation systems. We propose a novel approach that combines advanced computational methods with practical applications. Our experimental results demonstrate significant improvements in performance metrics. The methodology involves comprehensive data collection, rigorous analysis, and validation through multiple test scenarios. Future work will focus on scalability and real-world deployment considerations.",
    "domain": "psychology",
    "language": "en",
    "year": "2021",
    "generated": true
  },
  {
    "source": "jstage",
    "title": "Research on Natural Language Processing",
    "content": "This paper presents a novel approach to text analysis. The experimental results demonstrate significant improvements.",
    "domain": "economics",
    "language": "en",
    "year": "2024"
  },
  {
    "source": "jstage",
    "title": "Study on Deep Learning and 生物学",
    "content": "This study investigates the application of artificial intelligence in 工学. 実験では、machine learningアルゴリズムを用いて解析を行った。",
    "domain": "engineering",
    "language": "en-ja",
    "year": "2023"
  },
  {
    "source": "jstage",
    "title": "Study on ML and 物理学",
    "content": "This study investigates the application of artificial intelligence in 経済学. 実験では、machine learningアルゴリズムを用いて解析を行った。",
    "domain": "computer_science",
    "language": "en-ja",
    "year": "2022"
  },
  {
    "source": "jstage",
    "title": "Research on Robotics",
    "content": "This paper presents a novel approach to autonomous systems. The experimental results demonstrate significant improvements.",
    "domain": "economics",
    "language": "en",
    "year": "2021"
  },
  {
    "source": "pubmed",
    "title": "Application of data mining in epidemiology: A systematic review",
    "content": "Background: The application of data mining epidemiology has shown promising results in recent studies. Methods: We conducted a systematic review of literature published between 2020-2024. Results: Our analysis revealed significant improvements in diagnostic accuracy and treatment outcomes. Conclusion: data mining represents a valuable tool for advancing epidemiology practice.",
    "domain": "medicine",
    "language": "en",
    "year": "2022"
  },
  {
    "source": "arxiv",
    "title": "Big Data Analytics for Business Intelligence",
    "content": "This study investigates big data analytics for business intelligence. We propose a novel approach that combines advanced computational methods with practical applications. Our experimental results demonstrate significant improvements in performance metrics. The methodology involves comprehensive data collection, rigorous analysis, and validation through multiple test scenarios. Future work will focus on scalability and real-world deployment considerations.",
    "domain": "computational_biology",
    "language": "en",
    "year": "2024",
    "generated": true
  },
  {
    "source": "jstage",
    "title": "Research on Computer Vision",
    "content": "This paper presents a novel approach to image recognition. The experimental results demonstrate significant improvements.",
    "domain": "economics",
    "language": "en",
    "year": "2022"
  },
  {
    "source": "jstage",
    "title": "Machine learning による日本語sentiment analysis",
    "content": "This research focuses on Machine learning による日本語sentiment analysis. 本研究では、advanced technology と traditional methods を組み合わせたapproachを提案する。Experimental results show that 提案手法は従来手法よりも優れた性能を示した。Future research will explore より実用的なapplicationsを検討する。",
    "domain": "online_learning",
    "language": "en-ja",
    "year": "2021",
    "generated": true
  },
  {
    "source": "pubmed",
    "title": "Application of data mining in epidemiology: A systematic review",
    "content": "Background: The application of data mining epidemiology has shown promising results in recent studies. Methods: We conducted a systematic review of literature published between 2020-2024. Results: Our analysis revealed significant improvements in diagnostic accuracy and treatment outcomes. Conclusion: data mining represents a valuable tool for advancing epidemiology practice.",
    "domain": "medicine",
    "language": "en",
    "year": "2020"
  },
  {
    "source": "jstage",
    "title": "Blockchain technology in 金融サービス innovation",
    "content": "This research focuses on Blockchain technology in 金融サービス innovation. 本研究では、advanced technology と traditional methods を組み合わせたapproachを提案する。Experimental results show that 提案手法は従来手法よりも優れた性能を示した。Future research will explore より実用的なapplicationsを検討する。",
    "domain": "natural_language_processing",
    "language": "en-ja",
    "year": "2020",
    "generated": true
  },
  {
    "source": "arxiv",
    "title": "Big Data Analytics for Business Intelligence",
    "content": "This study investigates big data analytics for business intelligence. We propose a novel approach that combines advanced computational methods with practical applications. Our experimental results demonstrate significant improvements in performance metrics. The methodology involves comprehensive data collection, rigorous analysis, and validation through multiple test scenarios. Future work will focus on scalability and real-world deployment considerations.",
    "domain": "climate_change",
    "language": "en",
    "year": "2023",
    "generated": true
  },
  {
    "source": "jstage",
    "title": "生物学に関する研究 第16報",
    "content": "本研究では経済学の応用について検討した。実験結果により、提案手法の有効性が確認された。",
    "domain": "physics",
    "language": "ja",
    "year": "2024"
  },
  {
    "source": "acm",
    "title": "AI Ethics and Algorithmic Bias",
    "content": "This study investigates ai ethics and algorithmic bias. We propose a novel approach that combines advanced computational methods with practical applications. Our experimental results demonstrate significant improvements in performance metrics. The methodology involves comprehensive data collection, rigorous analysis, and validation through multiple test scenarios. Future work will focus on scalability and real-world deployment considerations.",
    "domain": "medical_informatics",
    "language": "en",
    "year": "2020",
    "generated": true
  },
  {
    "source": "jstage",
    "title": "人工知能に関する研究 第19報",
    "content": "本研究では経済学の応用について検討した。実験結果により、提案手法の有効性が確認された。",
    "domain": "computer_science",
    "language": "ja",
    "year": "2022"
  },
  {
    "source": "arxiv",
    "title": "デジタルヘルスケアプラットフォーム",
    "content": "本研究ではデジタルヘルスケアプラットフォームについて検討する。従来手法の課題を解決するため、新しいアプローチを提案した。実験結果により、提案手法の有効性が確認された。今後は実用化に向けた検討を進める予定である。",
    "domain": "computational_biology",
    "language": "ja",
    "year": "2022",
    "generated": true
  },
  {
    "source": "jstage",
    "title": "ブロックチェーン技術の食品トレーサビリティ",
    "content": "本研究ではブロックチェーン技術の食品トレーサビリティについて検討する。従来手法の課題を解決するため、新しいアプローチを提案した。実験結果により、提案手法の有効性が確認された。今後は実用化に向けた検討を進める予定である。",
    "domain": "communication_studies",
    "language": "ja",
    "year": "2024",
    "generated": true
  },
  {
    "source": "jstage",
    "title": "Research on Natural Language Processing",
    "content": "This paper presents a novel approach to autonomous systems. The experimental results demonstrate significant improvements.",
    "domain": "medicine",
    "language": "en",
    "year": "2022"
  },
  {
    "source": "jstage",
    "title": "Research on Robotics",
    "content": "This paper presents a novel approach to text analysis. The experimental results demonstrate significant improvements.",
    "domain": "economics",
    "language": "en",
    "year": "2022"
  },
  {
    "source": "jstage",
    "title": "Data analytics for 消費者行動 prediction",
    "content": "This research focuses on Data analytics for 消費者行動 prediction. 本研究では、advanced technology と traditional methods を組み合わせたapproachを提案する。Experimental results show that 提案手法は従来手法よりも優れた性能を示した。Future research will explore より実用的なapplicationsを検討する。",
    "domain": "quantum_computing",
    "language": "en-ja",
    "year": "2020",
    "generated": true
  },
  {
    "source": "pubmed",
    "title": "Cybersecurity in IoT Networks",
    "content": "This study investigates cybersecurity in iot networks. We propose a novel approach that combines advanced computational methods with practical applications. Our experimental results demonstrate significant improvements in performance metrics. The methodology involves comprehensive data collection, rigorous analysis, and validation through multiple test scenarios. Future work will focus on scalability and real-world deployment considerations.",
    "domain": "behavioral_economics",
    "language": "en",
    "year": "2020",
    "generated": true
  },
  {
    "source": "jstage",
    "title": "機械学習に関する研究 第7報",
    "content": "本研究では物理学の応用について検討した。実験結果により、提案手法の有効性が確認された。",
    "domain": "engineering",
    "language": "ja",
    "year": "2020"
  },
  {
    "source": "pubmed",
    "title": "Application of data mining in epidemiology: A systematic review",
    "content": "Background: The application of data mining epidemiology has shown promising results in recent studies. Methods: We conducted a systematic review of literature published between 2020-2024. Results: Our analysis revealed significant improvements in diagnostic accuracy and treatment outcomes. Conclusion: data mining represents a valuable tool for advancing epidemiology practice.",
    "domain": "medicine",
    "language": "en",
    "year": "2021"
  },
  {
    "source": "arxiv",
    "title": "Zero-Shot Tree Detection and Segmentation from Aerial Forest Imagery",
    "content": "Large-scale delineation of individual trees from remote sensing imagery is\ncrucial to the advancement of ecological research, particularly as climate\nchange and other environmental factors rapidly transform forest landscapes\nacross the world. Current RGB tree segmentation methods rely on training\nspecialized machine learning models with labeled tree datasets. While these\nlearning-based approaches can outperform manual data collection when accurate,\nthe existing models still depend on training data that's hard to scale. In this\npaper, we investigate the efficacy of using a state-of-the-art image\nsegmentation model, Segment Anything Model 2 (SAM2), in a zero-shot manner for\nindividual tree detection and segmentation. We evaluate a pretrained SAM2 model\non two tasks in this domain: (1) zero-shot segmentation and (2) zero-shot\ntransfer by using predictions from an existing tree detection model as prompts.\nOur results suggest that SAM2 not only has impressive generalization\ncapabilities, but also can form a natural synergy with specialized methods\ntrained on in-domain labeled data. We find that applying large pretrained\nmodels to problems in remote sensing is a promising avenue for future progress.\nWe make our code available at:\nhttps://github.com/open-forest-observatory/tree-detection-framework.",
    "category": "cs.CV",
    "published": "2025-06-03T17:44:43Z",
    "language": "en",
    "domain": "computer_vision"
  },
  {
    "source": "arxiv",
    "title": "データサイエンスによる都市交通最適化",
    "content": "本研究ではデータサイエンスによる都市交通最適化について検討する。従来手法の課題を解決するため、新しいアプローチを提案した。実験結果により、提案手法の有効性が確認された。今後は実用化に向けた検討を進める予定である。",
    "domain": "online_learning",
    "language": "ja",
    "year": "2024",
    "generated": true
  },
  {
    "source": "jstage",
    "title": "データサイエンスに関する研究 第4報",
    "content": "本研究ではデータサイエンスの応用について検討した。実験結果により、提案手法の有効性が確認された。",
    "domain": "physics",
    "language": "ja",
    "year": "2023"
  },
  {
    "source": "pubmed",
    "title": "Application of natural language in clinical: A systematic review",
    "content": "Background: The application of natural language processing clinical has shown promising results in recent studies. Methods: We conducted a systematic review of literature published between 2020-2024. Results: Our analysis revealed significant improvements in diagnostic accuracy and treatment outcomes. Conclusion: natural language represents a valuable tool for advancing clinical practice.",
    "domain": "medicine",
    "language": "en",
    "year": "2021"
  },
  {
    "source": "pubmed",
    "title": "Application of machine learning in healthcare: A systematic review",
    "content": "Background: The application of machine learning healthcare has shown promising results in recent studies. Methods: We conducted a systematic review of literature published between 2020-2024. Results: Our analysis revealed significant improvements in diagnostic accuracy and treatment outcomes. Conclusion: machine learning represents a valuable tool for advancing healthcare practice.",
    "domain": "medicine",
    "language": "en",
    "year": "2020"
  },
  {
    "source": "jstage",
    "title": "Study on AI and 経済学",
    "content": "This study investigates the application of artificial intelligence in 物理学. 実験では、machine learningアルゴリズムを用いて解析を行った。",
    "domain": "biology",
    "language": "en-ja",
    "year": "2023"
  },
  {
    "source": "springer",
    "title": "Quantum Machine Learning Algorithms",
    "content": "This study investigates quantum machine learning algorithms. We propose a novel approach that combines advanced computational methods with practical applications. Our experimental results demonstrate significant improvements in performance metrics. The methodology involves comprehensive data collection, rigorous analysis, and validation through multiple test scenarios. Future work will focus on scalability and real-world deployment considerations.",
    "domain": "economics",
    "language": "en",
    "year": "2020",
    "generated": true
  },
  {
    "source": "springer",
    "title": "Natural Language Processing for Legal Documents",
    "content": "This study investigates natural language processing for legal documents. We propose a novel approach that combines advanced computational methods with practical applications. Our experimental results demonstrate significant improvements in performance metrics. The methodology involves comprehensive data collection, rigorous analysis, and validation through multiple test scenarios. Future work will focus on scalability and real-world deployment considerations.",
    "domain": "software_engineering",
    "language": "en",
    "year": "2024",
    "generated": true
  },
  {
    "source": "pubmed",
    "title": "Application of computer vision in radiology: A systematic review",
    "content": "Background: The application of computer vision radiology has shown promising results in recent studies. Methods: We conducted a systematic review of literature published between 2020-2024. Results: Our analysis revealed significant improvements in diagnostic accuracy and treatment outcomes. Conclusion: computer vision represents a valuable tool for advancing radiology practice.",
    "domain": "medicine",
    "language": "en",
    "year": "2021"
  },
  {
    "source": "jstage",
    "title": "Research on Computer Vision",
    "content": "This paper presents a novel approach to image recognition. The experimental results demonstrate significant improvements.",
    "domain": "economics",
    "language": "en",
    "year": "2021"
  },
  {
    "source": "jstage",
    "title": "医学に関する研究 第13報",
    "content": "本研究では医学の応用について検討した。実験結果により、提案手法の有効性が確認された。",
    "domain": "computer_science",
    "language": "ja",
    "year": "2021"
  },
  {
    "source": "pubmed",
    "title": "Application of deep learning in imaging: A systematic review",
    "content": "Background: The application of deep learning medical imaging has shown promising results in recent studies. Methods: We conducted a systematic review of literature published between 2020-2024. Results: Our analysis revealed significant improvements in diagnostic accuracy and treatment outcomes. Conclusion: deep learning represents a valuable tool for advancing imaging practice.",
    "domain": "medicine",
    "language": "en",
    "year": "2021"
  },
  {
    "source": "pubmed",
    "title": "Application of deep learning in imaging: A systematic review",
    "content": "Background: The application of deep learning medical imaging has shown promising results in recent studies. Methods: We conducted a systematic review of literature published between 2020-2024. Results: Our analysis revealed significant improvements in diagnostic accuracy and treatment outcomes. Conclusion: deep learning represents a valuable tool for advancing imaging practice.",
    "domain": "medicine",
    "language": "en",
    "year": "2023"
  },
  {
    "source": "arxiv",
    "title": "AI-driven 製造プロセス optimization",
    "content": "This research focuses on AI-driven 製造プロセス optimization. 本研究では、advanced technology と traditional methods を組み合わせたapproachを提案する。Experimental results show that 提案手法は従来手法よりも優れた性能を示した。Future research will explore より実用的なapplicationsを検討する。",
    "domain": "human_computer_interaction",
    "language": "en-ja",
    "year": "2023",
    "generated": true
  },
  {
    "source": "jstage",
    "title": "Study on ML and 経済学",
    "content": "This study investigates the application of artificial intelligence in コンピュータサイエンス. 実験では、machine learningアルゴリズムを用いて解析を行った。",
    "domain": "economics",
    "language": "en-ja",
    "year": "2023"
  },
  {
    "source": "jstage",
    "title": "Research on Computer Vision",
    "content": "This paper presents a novel approach to image recognition. The experimental results demonstrate significant improvements.",
    "domain": "physics",
    "language": "en",
    "year": "2023"
  },
  {
    "source": "jstage",
    "title": "Social Media Impact on Mental Health",
    "content": "This study investigates social media impact on mental health. We propose a novel approach that combines advanced computational methods with practical applications. Our experimental results demonstrate significant improvements in performance metrics. The methodology involves comprehensive data collection, rigorous analysis, and validation through multiple test scenarios. Future work will focus on scalability and real-world deployment considerations.",
    "domain": "green_technology",
    "language": "en",
    "year": "2023",
    "generated": true
  },
  {
    "source": "arxiv",
    "title": "Enhancing Large Language Models with Neurosymbolic Reasoning for\n  Multilingual Tasks",
    "content": "Large language models (LLMs) often struggle to perform multi-target reasoning\nin long-context scenarios where relevant information is scattered across\nextensive documents. To address this challenge, we introduce NeuroSymbolic\nAugmented Reasoning (NSAR), which combines the benefits of neural and symbolic\nreasoning during inference. NSAR explicitly extracts symbolic facts from text\nand generates executable Python code to handle complex reasoning steps. Through\nextensive experiments across seven languages and diverse context lengths, we\ndemonstrate that NSAR significantly outperforms both a vanilla RAG baseline and\nadvanced prompting strategies in accurately identifying and synthesizing\nmultiple pieces of information. Our results highlight the effectiveness of\ncombining explicit symbolic operations with neural inference for robust,\ninterpretable, and scalable reasoning in multilingual settings.",
    "category": "cs.CL",
    "published": "2025-06-03T05:54:20Z",
    "language": "en",
    "domain": "natural_language_processing"
  },
  {
    "source": "arxiv",
    "title": "Causal Estimation of Tokenisation Bias",
    "content": "Modern language models are typically trained over subword sequences, but\nultimately define probabilities over character-strings. Ideally, the choice of\nthe tokeniser -- which maps character-strings to subwords -- should not affect\nthe probability assigned to the underlying character-string; in practice, it\ndoes. We define this mismatch as tokenisation bias. In this work, we quantify\none particular type of tokenisation bias: the effect of including or not a\nsubword (e.g., $\\langle hello \\rangle$) in a tokeniser's vocabulary on the\nprobability a trained model assigns to the corresponding characters (i.e.,\n\\textit{``hello''}). Estimating this effect is challenging because each model\nis trained with only one tokeniser. We address this by framing tokenisation\nbias as a causal effect and estimating it using the regression discontinuity\ndesign. Specifically, we exploit the fact that tokenisation algorithms rank\nsubwords and add the first $K$ to a tokeniser's vocabulary, where $K$ is an\narbitrary cutoff point. As such, we can estimate a causal effect by comparing\nsimilar subwords around this cutoff. Experimentally, we find that tokenisation\nconsistently affects models' outputs across scales, vocabularies, and\ntokenisers. Notably, a subword's presence in a small model's vocabulary may\nincrease its characters' probability by up to 17 times, highlighting\ntokenisation as a key design choice in language modelling.",
    "category": "cs.LG",
    "published": "2025-06-03T17:59:47Z",
    "language": "en",
    "domain": "machine_learning"
  },
  {
    "source": "pubmed",
    "title": "Application of data mining in epidemiology: A systematic review",
    "content": "Background: The application of data mining epidemiology has shown promising results in recent studies. Methods: We conducted a systematic review of literature published between 2020-2024. Results: Our analysis revealed significant improvements in diagnostic accuracy and treatment outcomes. Conclusion: data mining represents a valuable tool for advancing epidemiology practice.",
    "domain": "medicine",
    "language": "en",
    "year": "2024"
  },
  {
    "source": "jstage",
    "title": "Cybersecurity measures for クラウドコンピューティング",
    "content": "This research focuses on Cybersecurity measures for クラウドコンピューティング. 本研究では、advanced technology と traditional methods を組み合わせたapproachを提案する。Experimental results show that 提案手法は従来手法よりも優れた性能を示した。Future research will explore より実用的なapplicationsを検討する。",
    "domain": "communication_studies",
    "language": "en-ja",
    "year": "2021",
    "generated": true
  },
  {
    "source": "jstage",
    "title": "量子コンピューティングの暗号化技術",
    "content": "本研究では量子コンピューティングの暗号化技術について検討する。従来手法の課題を解決するため、新しいアプローチを提案した。実験結果により、提案手法の有効性が確認された。今後は実用化に向けた検討を進める予定である。",
    "domain": "software_engineering",
    "language": "ja",
    "year": "2024",
    "generated": true
  },
  {
    "source": "acm",
    "title": "ロボット技術の高齢者介護への応用",
    "content": "本研究ではロボット技術の高齢者介護への応用について検討する。従来手法の課題を解決するため、新しいアプローチを提案した。実験結果により、提案手法の有効性が確認された。今後は実用化に向けた検討を進める予定である。",
    "domain": "marketing_research",
    "language": "ja",
    "year": "2021",
    "generated": true
  },
  {
    "source": "acm",
    "title": "Natural language processing in 多言語対応システム",
    "content": "This research focuses on Natural language processing in 多言語対応システム. 本研究では、advanced technology と traditional methods を組み合わせたapproachを提案する。Experimental results show that 提案手法は従来手法よりも優れた性能を示した。Future research will explore より実用的なapplicationsを検討する。",
    "domain": "robotics",
    "language": "en-ja",
    "year": "2021",
    "generated": true
  },
  {
    "source": "jstage",
    "title": "Study on AI and 人工知能",
    "content": "This study investigates the application of artificial intelligence in 人工知能. 実験では、machine learningアルゴリズムを用いて解析を行った。",
    "domain": "medicine",
    "language": "en-ja",
    "year": "2024"
  },
  {
    "source": "jstage",
    "title": "ブロックチェーン技術の食品トレーサビリティ",
    "content": "本研究ではブロックチェーン技術の食品トレーサビリティについて検討する。従来手法の課題を解決するため、新しいアプローチを提案した。実験結果により、提案手法の有効性が確認された。今後は実用化に向けた検討を進める予定である。",
    "domain": "environmental_science",
    "language": "ja",
    "year": "2020",
    "generated": true
  },
  {
    "source": "jstage",
    "title": "Study on ML and 生物学",
    "content": "This study investigates the application of artificial intelligence in 工学. 実験では、machine learningアルゴリズムを用いて解析を行った。",
    "domain": "medicine",
    "language": "en-ja",
    "year": "2022"
  },
  {
    "source": "springer",
    "title": "Smart City Infrastructure Development",
    "content": "This study investigates smart city infrastructure development. We propose a novel approach that combines advanced computational methods with practical applications. Our experimental results demonstrate significant improvements in performance metrics. The methodology involves comprehensive data collection, rigorous analysis, and validation through multiple test scenarios. Future work will focus on scalability and real-world deployment considerations.",
    "domain": "social_media_analysis",
    "language": "en",
    "year": "2023",
    "generated": true
  },
  {
    "source": "pubmed",
    "title": "Data analytics for 消費者行動 prediction",
    "content": "This research focuses on Data analytics for 消費者行動 prediction. 本研究では、advanced technology と traditional methods を組み合わせたapproachを提案する。Experimental results show that 提案手法は従来手法よりも優れた性能を示した。Future research will explore より実用的なapplicationsを検討する。",
    "domain": "online_learning",
    "language": "en-ja",
    "year": "2023",
    "generated": true
  },
  {
    "source": "jstage",
    "title": "Study on ML and 心理学",
    "content": "This study investigates the application of artificial intelligence in 人工知能. 実験では、machine learningアルゴリズムを用いて解析を行った。",
    "domain": "economics",
    "language": "en-ja",
    "year": "2024"
  },
  {
    "source": "jstage",
    "title": "Research on Computer Vision",
    "content": "This paper presents a novel approach to image recognition. The experimental results demonstrate significant improvements.",
    "domain": "biology",
    "language": "en",
    "year": "2023"
  },
  {
    "source": "acm",
    "title": "IoTセンサーネットワークの環境監視",
    "content": "本研究ではIoTセンサーネットワークの環境監視について検討する。従来手法の課題を解決するため、新しいアプローチを提案した。実験結果により、提案手法の有効性が確認された。今後は実用化に向けた検討を進める予定である。",
    "domain": "neuroscience",
    "language": "ja",
    "year": "2023",
    "generated": true
  },
  {
    "source": "arxiv",
    "title": "バーチャルリアリティの教育活用",
    "content": "本研究ではバーチャルリアリティの教育活用について検討する。従来手法の課題を解決するため、新しいアプローチを提案した。実験結果により、提案手法の有効性が確認された。今後は実用化に向けた検討を進める予定である。",
    "domain": "quantum_computing",
    "language": "ja",
    "year": "2024",
    "generated": true
  },
  {
    "source": "acm",
    "title": "サイバーセキュリティ対策技術",
    "content": "本研究ではサイバーセキュリティ対策技術について検討する。従来手法の課題を解決するため、新しいアプローチを提案した。実験結果により、提案手法の有効性が確認された。今後は実用化に向けた検討を進める予定である。",
    "domain": "software_engineering",
    "language": "ja",
    "year": "2021",
    "generated": true
  },
  {
    "source": "jstage",
    "title": "IoT systems for スマート農業 development",
    "content": "This research focuses on IoT systems for スマート農業 development. 本研究では、advanced technology と traditional methods を組み合わせたapproachを提案する。Experimental results show that 提案手法は従来手法よりも優れた性能を示した。Future research will explore より実用的なapplicationsを検討する。",
    "domain": "computer_vision",
    "language": "en-ja",
    "year": "2022",
    "generated": true
  },
  {
    "source": "arxiv",
    "title": "AI-driven 製造プロセス optimization",
    "content": "This research focuses on AI-driven 製造プロセス optimization. 本研究では、advanced technology と traditional methods を組み合わせたapproachを提案する。Experimental results show that 提案手法は従来手法よりも優れた性能を示した。Future research will explore より実用的なapplicationsを検討する。",
    "domain": "finance",
    "language": "en-ja",
    "year": "2020",
    "generated": true
  },
  {
    "source": "pubmed",
    "title": "Application of data mining in epidemiology: A systematic review",
    "content": "Background: The application of data mining epidemiology has shown promising results in recent studies. Methods: We conducted a systematic review of literature published between 2020-2024. Results: Our analysis revealed significant improvements in diagnostic accuracy and treatment outcomes. Conclusion: data mining represents a valuable tool for advancing epidemiology practice.",
    "domain": "medicine",
    "language": "en",
    "year": "2023"
  },
  {
    "source": "pubmed",
    "title": "Application of artificial intelligence in medicine: A systematic review",
    "content": "Background: The application of artificial intelligence medicine has shown promising results in recent studies. Methods: We conducted a systematic review of literature published between 2020-2024. Results: Our analysis revealed significant improvements in diagnostic accuracy and treatment outcomes. Conclusion: artificial intelligence represents a valuable tool for advancing medicine practice.",
    "domain": "medicine",
    "language": "en",
    "year": "2023"
  },
  {
    "source": "ieee",
    "title": "コンピュータビジョンの農業応用",
    "content": "本研究ではコンピュータビジョンの農業応用について検討する。従来手法の課題を解決するため、新しいアプローチを提案した。実験結果により、提案手法の有効性が確認された。今後は実用化に向けた検討を進める予定である。",
    "domain": "education_technology",
    "language": "ja",
    "year": "2020",
    "generated": true
  },
  {
    "source": "arxiv",
    "title": "PoLAR: Polar-Decomposed Low-Rank Adapter Representation",
    "content": "We show that low-rank adaptation of large-scale models suffers from a low\nstable rank that is well below the linear algebraic rank of the subspace,\ndegrading fine-tuning performance. To mitigate the underutilization of the\nallocated subspace, we propose PoLAR, a parameterization inspired by the polar\ndecomposition that factorizes the low-rank update into two direction matrices\nconstrained to Stiefel manifolds and an unconstrained scale matrix. Our theory\nshows that PoLAR yields an exponentially faster convergence rate on a canonical\nlow-rank adaptation problem. Pairing the parameterization with Riemannian\noptimization leads to consistent gains on three different benchmarks testing\ngeneral language understanding, commonsense reasoning, and mathematical problem\nsolving with base model sizes ranging from 350M to 27B.",
    "category": "cs.AI",
    "published": "2025-06-03T17:58:19Z",
    "language": "en",
    "domain": "artificial_intelligence"
  },
  {
    "source": "jstage",
    "title": "心理学に関する研究 第22報",
    "content": "本研究では機械学習の応用について検討した。実験結果により、提案手法の有効性が確認された。",
    "domain": "computer_science",
    "language": "ja",
    "year": "2023"
  },
  {
    "source": "jstage",
    "title": "生物学に関する研究 第10報",
    "content": "本研究ではデータサイエンスの応用について検討した。実験結果により、提案手法の有効性が確認された。",
    "domain": "engineering",
    "language": "ja",
    "year": "2024"
  },
  {
    "source": "ieee",
    "title": "AI-driven 製造プロセス optimization",
    "content": "This research focuses on AI-driven 製造プロセス optimization. 本研究では、advanced technology と traditional methods を組み合わせたapproachを提案する。Experimental results show that 提案手法は従来手法よりも優れた性能を示した。Future research will explore より実用的なapplicationsを検討する。",
    "domain": "computer_vision",
    "language": "en-ja",
    "year": "2022",
    "generated": true
  },
  {
    "source": "pubmed",
    "title": "Application of natural language in clinical: A systematic review",
    "content": "Background: The application of natural language processing clinical has shown promising results in recent studies. Methods: We conducted a systematic review of literature published between 2020-2024. Results: Our analysis revealed significant improvements in diagnostic accuracy and treatment outcomes. Conclusion: natural language represents a valuable tool for advancing clinical practice.",
    "domain": "medicine",
    "language": "en",
    "year": "2022"
  },
  {
    "source": "jstage",
    "title": "医学に関する研究 第1報",
    "content": "本研究では経済学の応用について検討した。実験結果により、提案手法の有効性が確認された。",
    "domain": "computer_science",
    "language": "ja",
    "year": "2023"
  },
  {
    "source": "arxiv",
    "title": "IllumiCraft: Unified Geometry and Illumination Diffusion for\n  Controllable Video Generation",
    "content": "Although diffusion-based models can generate high-quality and high-resolution\nvideo sequences from textual or image inputs, they lack explicit integration of\ngeometric cues when controlling scene lighting and visual appearance across\nframes. To address this limitation, we propose IllumiCraft, an end-to-end\ndiffusion framework accepting three complementary inputs: (1)\nhigh-dynamic-range (HDR) video maps for detailed lighting control; (2)\nsynthetically relit frames with randomized illumination changes (optionally\npaired with a static background reference image) to provide appearance cues;\nand (3) 3D point tracks that capture precise 3D geometry information. By\nintegrating the lighting, appearance, and geometry cues within a unified\ndiffusion architecture, IllumiCraft generates temporally coherent videos\naligned with user-defined prompts. It supports background-conditioned and\ntext-conditioned video relighting and provides better fidelity than existing\ncontrollable video generation methods. Project Page:\nhttps://yuanze-lin.me/IllumiCraft_page",
    "category": "cs.CV",
    "published": "2025-06-03T17:59:52Z",
    "language": "en",
    "domain": "computer_vision"
  },
  {
    "source": "arxiv",
    "title": "IllumiCraft: Unified Geometry and Illumination Diffusion for\n  Controllable Video Generation",
    "content": "Although diffusion-based models can generate high-quality and high-resolution\nvideo sequences from textual or image inputs, they lack explicit integration of\ngeometric cues when controlling scene lighting and visual appearance across\nframes. To address this limitation, we propose IllumiCraft, an end-to-end\ndiffusion framework accepting three complementary inputs: (1)\nhigh-dynamic-range (HDR) video maps for detailed lighting control; (2)\nsynthetically relit frames with randomized illumination changes (optionally\npaired with a static background reference image) to provide appearance cues;\nand (3) 3D point tracks that capture precise 3D geometry information. By\nintegrating the lighting, appearance, and geometry cues within a unified\ndiffusion architecture, IllumiCraft generates temporally coherent videos\naligned with user-defined prompts. It supports background-conditioned and\ntext-conditioned video relighting and provides better fidelity than existing\ncontrollable video generation methods. Project Page:\nhttps://yuanze-lin.me/IllumiCraft_page",
    "category": "cs.LG",
    "published": "2025-06-03T17:59:52Z",
    "language": "en",
    "domain": "machine_learning"
  }
]